   
   var workTitles= {
       'குடும்ப அட்டை': ["புதிய மின்னணு குடும்ப அட்டை விண்ணப்ப", "நகல் மின்னணு குடும்ப அட்டை விண்ணப்ப", "குடும்ப அட்டையில் குடும்ப தலைவர் மாற்றம்", "குடும்ப‌ உறுப்பினர் சேர்க்கை", "குடும்ப உறுப்பினர் நீக்கம்", "குடும்ப அட்டை முகவரி மாற்றம்", "குடும்ப அட்டையில் கைபேசி எண் இணைக்க"],
       "ஆதார்": ["ஆதார் முகவரி மாற்றம்", "ஆதார் பெயர் மாற்றம்", "ஆதார் அகவை நாள் மாற்றம்", "ஆதார் முகவரி (ம) பெயர் மாற்றம்", "ஆதார் அகவை நாள், (ம) முகவரி மாற்றம்பம்", "ஆதார் அகவை நாள், (ம) பெயர், மாற்றம்", "ஆதார் அகவை நாள், பெயர், (ம) முகவரி மாற்றம்", "ஆதார் பாலினம் மாற்றம்"],
       "பான்": ["புதிய பான் அட்டை விண்ணப்பம்", "பான் எண்ணை ஆதாரில் இணைத்தால்", "நகல் பான் அட்டை", "பான் அட்டையில் அகவை நாள் மாற்றம்", "பான் அட்டையில் பெயர் மாற்றம்", "பான் அட்டையில் புகைப்படம் மாற்றம்", "பான் அட்டையில் கையெழுத்து புதுபித்தல்", "பான் அட்டையில் சிறியவரிலிருந்து பெரியவர்"],
       "நலவாரியம்": ["நலவாரியம் புதுப்பித்தல்", "நலவாரியம் விண்ணப்பித்தால்"],
       "வாக்காளர் அட்டை": ["புதிய வாக்காளர் அட்டை விண்ணப்பம் புதுப்பித்தல்", "வாக்காளர் அட்டையில் முகவரி மாற்றம்", "நகல் வாக்காளர் அட்டை விண்ணப்பம்", "வாக்காளர் அட்டையில் பெயர் மாற்றம்", "வாக்காளர் அட்டையில் அகவை நாள் மாற்றம்", "வாக்காளர் அட்டையில் புகைப்படம் மாற்றம்", "வாக்காளர் அட்டையில் உறவு முறை பெயர் மாற்றம்", "வாக்காளர் அட்டையில் தொகுதி மாற்றம்"],
   }
   //                  வேலைகள் தலைப்பு
   // function workTitle(value) {
   //     if (value.length == 0) document.getElementById("work").innerHTML = "<option></option>";
   //     else {
   //         var catOneOptions = "";
   //         for (categoryId in workTitles[value]) {
   //             catOneOptions += "<option>" + workTitles[value][categoryId] + "</option>";
   //         }
   //         document.getElementById("work").innerHTML = catOneOptions; // data write on "WORK"
   //     }
   // }
   // work titel to work 
   
   
   
   // ==========================================================================================================
   var ondriyum = {
   "Town": ["Karumandurai", "Town 1", "Town 2", "Town 3"],
   "Small Town": ["Koilputhur", "Kariyakoil","Soolankuruchi"],
   "Town 1": ["Village 1","Village 2"],
   "Northampton":["Guild Hall","Vernon st"]
   }
   //                  ஒன்றியம்
   // function onDriyum(value) {
   //     if (value.length == 0) document.getElementById("city_Name").innerHTML = "<option></option>";
   //     else {
   //         var catwoOptions = "";
   //         for (categoryId in ondriyum[value]) {
   //           // console.log(categoryId)
   //             catwoOptions += "<option>" + ondriyum[value][categoryId] + "</option>";
   //             //  console.log(catwoOptions)
   //         }
   //         document.getElementById("city_Name").innerHTML = catwoOptions;
   //     }
   // }
   
   
   // ==========================================================================================================
   // Each "ஊர் பெயர்கள்" be a unique , Don't repeat, if is it repeat won't work 
   var cityNames = {
   // "பேரூராட்சி"
   "Town": ["Aranmanai st", "Street 2"],
   "இளம்பிள்ளை": ["உரிமை", "உரல்", "உண்மை", "உறவு"],
   "மல்லூர்": ["ஊர்", "ஊஞ்சல்", "ஊற்று", "ஊக்கம்"],
   "பனைமரத்துபட்டி பேரூராட்சி":[],
   
   // பனைமரத்துபட்டி
   "சந்தியூர்":[],
   "அமானி கொண்டலாம்பட்டி":[],
           // "அம்மாபாளையம்":[],
           
   // "வீரபாண்டி"
   "ஆணைக்குட்டப்பட்டி": ["கந்தசாமி கோவில் தெரு", "கந்தசாமி கோவில் தெரு", "மாரியம்மன் கோவில் தெரு"],
   "அக்கரபாளையம்":["லட்சுமனூர்","பலகான் தெரு","கொடம்புக்காடு"],
   "அமாணி கொண்டலாம்பட்டி":["சின்னக்கொண்டலாம்பட்டி","மாரியம்மன் கோவில் தெரு","கந்தசாமி கோவில் தெரு","சித்தன் நகர்"],
   "அம்மாபாளையம்":["கொத்துக்காட்டனூர்","ஆதிதிராவிடர் தெரு","பள்ளர் தெரு"],
   "ஆண்டிபட்டி":["லட்சுமி நகர்","ஆயா நகர்","பனங்காடு"],
   "சன்னியாசிகுண்டு":["மணல் காரர் வீதி","பாத்திமா நகர்","பீரான்சாயுபு நகர்","காமராஜர் நகர்"],
   
   // சேலம்
   "திருமலைகிரி":["1","2","3"],
   "வட்டமுத்தாம்பட்டி":[],
       // "ஆண்டிபட்டி":[],
       "சன்னியாசிகுண்டு":[],
       
   }
   //                     ஊர் பெயர்கள்
   // function cityName(value) {
   //     if (value.length == 0) document.getElementById("street_name").innerHTML = "<option></option>";
   //     else {
   //       // console.log(value);
   //         var catwoOptions = "";
   //         for (categoryId in cityNames[value]) {
   //             // console.log(categoryId)
   //             catwoOptions += "<option>" + cityNames[value][categoryId] + "</option>";
   //             // console.log(catwoOptions)
   //         }
   //         document.getElementById("street_name").innerHTML = catwoOptions;
   //     }
   // }
   
   // ==========================================================================================================
   // mobile number change
   function mobileNO(value){
   document.getElementById("co_nm").value = value;   
   }
   
   // ==========================================================================================================
   
   
   //   function caller(){
   //     // get user name
   //     document.getElementById("custId").value = localStorage.getItem('Name');
   //     let currentDate = new Date();
   //     let time = currentDate.getHours() + ":" + currentDate.getMinutes() + ":" + currentDate.getSeconds();
   //     // set time
   //     document.getElementById("cTime").value =time;
   //     // set date
   //     var fullDate = currentDate.getDate()+"-"+(currentDate.getMonth()+1) + "-"+currentDate.getFullYear();
   //     document.getElementById("cDate").value =fullDate;
   
   //   }
   // ==========================================================================================================
   
   function storeData(value){
   localStorage.setItem('Name', value);
   }
   
   // ==========================================================================================================
   
   // const scriptURL = 'https://script.google.com/macros/s/AKfycbxcasP7ae4j8njdljS823w6rAJWj7ce_9muJpmyEeMtNHB0Az1s5WVroyE99M9OMcET/exec'
   // const form = document.forms['google-sheet']
   
   // form.addEventListener('submit', e => {
     
   //   e.preventDefault()
   //   fetch(scriptURL, { method: 'POST', body: new FormData(form)})
   //     .then(response => alert("uploaded..!"))
   //     .catch(error => console.error('Error!', error.message))
   
   //     form.reset();
   // })
   
   
   //   ====================================================================================================
   let ration1 = ["புதிய மின்னணு குடும்ப அட்டை விண்ணப்ப", "நகல் மின்னணு குடும்ப அட்டை விண்ணப்ப", "குடும்ப அட்டையில் குடும்ப தலைவர் மாற்றம்", "குடும்ப‌ உறுப்பினர் சேர்க்கை", "குடும்ப உறுப்பினர் நீக்கம்", "குடும்ப அட்டை முகவரி மாற்றம்", "குடும்ப அட்டையில் கைபேசி எண் இணைக்க"];
   let aadhar1 = ["ஆதார் முகவரி மாற்றம்", "ஆதார் பெயர் மாற்றம்", "ஆதார் அகவை நாள் மாற்றம்", "ஆதார் முகவரி (ம) பெயர் மாற்றம்", "ஆதார் அகவை நாள், (ம) முகவரி மாற்றம்பம்", "ஆதார் அகவை நாள், (ம) பெயர், மாற்றம்", "ஆதார் அகவை நாள், பெயர், (ம) முகவரி மாற்றம்", "ஆதார் பாலினம் மாற்றம்"];
   let pan1 =  ["புதிய பான் அட்டை விண்ணப்பம்", "பான் எண்ணை ஆதாரில் இணைத்தால்", "நகல் பான் அட்டை", "பான் அட்டையில் அகவை நாள் மாற்றம்", "பான் அட்டையில் பெயர் மாற்றம்", "பான் அட்டையில் புகைப்படம் மாற்றம்", "பான் அட்டையில் கையெழுத்து புதுபித்தல்", "பான் அட்டையில் சிறியவரிலிருந்து பெரியவர்"];
   let nalavariyum1 = ["நலவாரியம் புதுப்பித்தல்", "நலவாரியம் விண்ணப்பித்தால்"];
   let voter_id1 = ["புதிய வாக்காளர் அட்டை விண்ணப்பம் புதுப்பித்தல்", "வாக்காளர் அட்டையில் முகவரி மாற்றம்", "நகல் வாக்காளர் அட்டை விண்ணப்பம்", "வாக்காளர் அட்டையில் பெயர் மாற்றம்", "வாக்காளர் அட்டையில் அகவை நாள் மாற்றம்", "வாக்காளர் அட்டையில் புகைப்படம் மாற்றம்", "வாக்காளர் அட்டையில் உறவு முறை பெயர் மாற்றம்", "வாக்காளர் அட்டையில் தொகுதி மாற்றம்"];
   function workTitle1(value){
   let selectss =  value;
   switch (selectss) {
       
       case "ஆதார்":
       
        ithura_1();
       
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<aadhar1.length;i++){
           itemOptions += "<option>" + aadhar1[i] + "</option>";
           console.log("2")
           document.getElementById("work").innerHTML = itemOptions;
           console.log("1")
        //    console.log(itemOptions)
       }
       break;
       case "Ration Card":
        ithura_1();
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<ration1.length;i++){
           itemOptions += "<option>" + ration1[i] + "</option>";
           document.getElementById("work").innerHTML = itemOptions;
       }
       break;
       case "பான்":
        ithura_1();
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<pan1.length;i++){
           itemOptions += "<option>" + pan1[i] + "</option>";
           document.getElementById("work").innerHTML = itemOptions;
       }
       break;
       case "நலவாரியம்":
        ithura_1();
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<nalavariyum1.length;i++){
           itemOptions += "<option>" + nalavariyum1[i] + "</option>";
           document.getElementById("work").innerHTML = itemOptions;
       }
       break;
       case "வாக்காளர் அட்டை":
        ithura_1();
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<voter_id1.length;i++){
           itemOptions += "<option>" + voter_id1[i] + "</option>";
           document.getElementById("work").innerHTML = itemOptions;
       }
       break;
        case "இதர":
            $("#workCover").hide();
            $("#ithura").show()
            
            
       break;

       default:
       
       break;
   }
   }
    //   ====================================================================================================
    // first ithura
    function ithura_1(){
        // document.write("dsadsa")
        
        
            if( $("#workCover").hide()){
                $("#workCover").show();
                $("#ithura").hide()
            }
            // else{
            //     $("#ithura").hide()
                
            //     $("#work").show()
                
            // }
            
    }

   //   ====================================================================================================
   
   // "புதிய மின்னணு குடும்ப அட்டை விண்ணப்ப"
   
   $('#work').on('change',function(){
   if( $(this).val()==="புதிய மின்னணு குடும்ப அட்டை விண்ணப்ப"){
       $("#new_card_det").show()
   }
   else{
       $("#new_card_det").hide()
   }
   });
   
   // ===================================================================================================================================
   

   // ============================================================================================================================
   
   ondriyum = ['Karumandurai','Attur', 'PNPalayam'];
   parurAchi = ['Belur', 'Thumpal', 'Yeathapur'];
   
   function locka(value){
   
   let selectss =  value;
   console.log(selectss)
   console.log(ondriyum);
   switch (selectss) {
       case "Town":
            others_1();
           // console.log("hdhkahskdhskdhkahsdk")
           var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
           for (let i=0;i<ondriyum.length;i++){
               itemOptions += "<option>" + ondriyum[i] + "</option>";
               document.getElementById("ondr").innerHTML = itemOptions;
           }
           
           break;
           case "Small Town":
            others_1();
           var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
           for (let i=0;i<parurAchi.length;i++){
               itemOptions += "<option>" + parurAchi[i] + "</option>";
               document.getElementById("ondr").innerHTML = itemOptions;
           }
           break;
           case "Other" :
        // hide 3 field 
           $("#ondr_1").hide();
           $("#oru_achi_hide_1").hide();
           $("#street_name_1").hide();
        //    show others
            $("#other_1").show()
            

           break;
           
           default:
           break;
       }
   }
   // ====================================================================================================================""
   function others_1(){
    // document.write("dsadsa")
    
        //  3 this  hiden -> show, hide "others"
        if( $("#ondr_1").hide()){
            $("#ondr_1").show();
            $("#oru_achi_hide_1").show();
            $("#street_name_1").show();

            $("#other_1").hide()
        }
        // else{
        //     $("#ithura").hide()
            
        //     $("#work").show()
            
        // }
        
}
   // ====================================================================================================================================
   // parur acchi irutha , uurachi no                                        
   $('#select_sel').on('change',function(){
   if( $(this).val()==="பேரூராட்சி"){
     $("#city_Name").hide()
   }
   else{
     $("#city_Name").show()
   }
   });
   
   // ====================================================================================================================================
   
   // ஊர் பெயர்கள் ---> ஊர் aachi
   let attiya_patti = ["காட்டுப்பாளையம் முனியப்பன் கோவில்", "இந்திராகாங்கிரஸ் விதி", "பிரதம சாஸ்திரி வீதி", "வ.உ. சிதம்பரனார் வீதி", "ஸ்டாலின் காலனி", "முனியப்பன் கோவில் வீதி", "வீரப்பன் வீதி", "டி.வி. திருமலை வீதி", "மளிகை கடை வீதி மேற்கு", "தம்பிதுரை வீதி", "நெசவாளர் காலனி", "நேருஜி வீதி மேற்கு", "நேருஜி வீதி கிழக்கு", "கருக்கம்பாளையத்தார் வீதி வடக்கு", "அம்மன் கோவில் வீதி", "காந்தியார் வீதி", "பாரதியார் வீதி", "சின்னப்பம்பட்டியார்-வீதி", "புகையிலக்கார வீதி", "அரசமர பிள்ளையார் கோவில்", "புதுமாரியம்மன் வீதி", "கே.வி.ஏ அர்த்தனாரி வீதி", "பி.ஏ குப்புசாமி வீதி", "அங்குதன் வீதி", "பெரியகடை வீதி", "ரைஸ்மில் வீதி", "காமராஜர் வீதி", "அங்கமுத்து தெரு", "பெரியார் வீதி", "வீரசிவாஜி வீதி", "பூவராகவன் வீதி", "இளங்கோ வீதி", "தேவராயர் வீதி", "செல்லப்பன் வீதி", "அய்யனாரப்பன் கோவில் வீதி", "நடுப்பிள்ளையார் கோவில் வீதி", "சீமெண்ணகார சின்னப்பன் வீதி", "வக்கீல் வீதி", "பசலக்கார கந்தசாமி வீதி", "சின்னகந்தப்பன் வீதி", "பூக்கார செல்லப்பன் வீதி", "வஜ்ரவேல் வீதி", "புதுபிள்ளையார் கோவில் வீதி", "தானகுட்டிபாளையம்", "சின்னமாரியம்மன் கோவில் வீதி", "வண்டுக்காடு", "ரத்தினவேல் காடு மேற்கு", "சின்னதம்பி வீதி", "மலைக்குழந்தை வீதி", "கரும்பையன் கந்தசாமி வீதி", "பழக்கார வீதி", "மாதேஸ்வரன் கோவில் வீதி", "கொட்டார சாவடி வீதி", "மங்கான் வீதி", "கருக்கம்பாளையத்தார் வீதி தெற்கு", "சித்தன் வீதி", "மளிகை கடை வீதி (சேலம் மெயின்ரோடு", "சுப்ராபுரம் வீதி", "ஆட்டையாம்பட்டி மாரியம்மன் கோவில்", "பத்மநாபன் வீதி", "சின்ன மாரியம்மன் கோவில் வீதி", "அண்ணமார் கோவில் வீதி", "செங்கோடன் வீதி", "தெலுங்குபாளையம்", "கேசவன் வீதி", "இந்திராகாந்தி வீதி", "ராசிபுரம் மெயின்ரோடு", "மணியகாரர் வீதி கிழக்கு", "மணியகாரர் வீதி", "மாரி வீதி", "திருமலை வீதி", "மூவேந்தர் வீதி", "பாரதிதாசன் வீதி", "ரத்தினவேல் காடு கிழக்கு", "திருச்செங்கோடு ரோடு", "தியாகி செல்லப்பன் தெரு", "மேட்டுப்பட்டி வீதி", "ஹைஸ்கூல் ரோடு"];
   let ela_pilai =  ["சேலம் - சின்னப்பம்பட்டி ரோடு", "ஓவர் டேன்க் தெரு", "சேலம் - சின்னப்பம்பட்டி ரோடு", "பாலகிருஷ்ண செட்டி தெரு","விஒ.குருநாதன் தெரு","கே.எம்.பெருமாள் தெரு","எஸ்.கே.டி.ராமசாமி தெரு","கே.பி.வீரிசெட்டி தெரு","கே.எல்.இலட்சுமண செட்டி தெரு","சவுண்டம்மன் கோவில் தெரு","பழைய பஞ்சாயத்து ஆபிஸ் தெரு","வேப்பமரத்தெரு","சுப்பிரமணியர் கோவில் – சந்தைபேட்டை ரோடு","இருசாகவுண்டர் தெரு","சுப்பிரமணியர் கோவில் - சந்தைபேட்டை ரோடு","ரெட்டிமணியக்காரனூர்","ரெட்டிமணியக்காரனூர் ரோடு","ரெட்டிமணியக்காரனூர் ரோடு","சி.ரங்கசாமி தெரு","கோபால் செட்டி தெரு","மடப்பள்ளி கோவில் தெரு","கே.என்.ஏ.பொன்னுசாமி தெரு","கே.எஸ்.ஏ.பொன்னுசாமி தெரு","கே.ஏ.சவுண்டப்ப செட்டி தெரு","தொட்டுதம்ம செட்டி தெரு","கே.பி.அர்த்தனாரிசாமி தெரு","பி.எஸ்.என்.இராஜமாணிக்கம் தெரு","நடுத்தெரு","வேங்கடதாஸ் தெரு","புதுத்தெரு","எல்.பி.வீரிசெட்டி தெரு","ஆர்.எஸ்.பி.கந்தசாமி தெரு","சங்கர செட்டி தெரு","பண்டரி கோவில் தெரு","ஆர்.எஸ்.பி.சித்தப்பசெட்டி தெரு","பி.என்.கோபால் செட்டி தெரு","உப்பு கிணறு தெரு","சேலம் - சின்னப்பம்பட்டி ரோடு","விஜய விநாயகர் கோவில் தெரு","சன்னனன்ன செட்டி தெரு","குருநாதசாமிகோவில் தெரு","காக்காபாளையம் - சின்னப்பம்பட்டி ரோடு","காக்காபாளையம் - சின்னப்பம்பட்டி ரோடு","திருமலை தெரு","திருமலை தெரு","காக்காபாளையம் - சின்னப்பம்பட்டி ரோடு","எம்.கே.வேலப்ப செட்டி தெரு","பாட்டப்பன்கோவில் தெரு","மடாகஞ்சி செட்டி தெரு","முத்தைய பண்டாரம் தெரு","சௌடேஸ்வரி நகர்","கர்ணம் ஆறுமுகம் தெரு","கருங்காளியம்மன் தெரு","எஸ்.வி.ஆர்.கோவிந்தராஜ் தெரு"];
   let malur = ["வேங்காம்பட்டி தெற்கு காட்டு கொட்டாய்","வேங்காம்பட்டி வீரபாண்டி ரோடு","வேங்காம்பட்டி வடக்கு காட்டு கொட்டாய்","வேங்காம்பட்டி வடக்கு காட்டு கொட்டாய்","கல்லியன் வளவு","மல்லூர் கிழக்கு காட்டு கொட்டாய்","பிச்சம்பாளையம்","திருச்சி மெயின் ரோடு","வீரபாண்டி ரோடு","பிள்ளையார் கோவில் முதல் கனைக்காடு ரோடு","வீரபாண்டி ரோடு","ஒட்டார் தெரு","ஓட்டக்காடு ரோடு","மதுரை வீரன் கோவில் தெரு","வேங்காம்பட்டி கீழ்த்தெரு","வேங்காம்பட்டி வீரபாண்டி ரோடு","வேங்காம்பட்டி கொமாரபாளையம் ரோடு","வீரபாண்டி ரோடு","வேங்காம்பட்டி முதல் கொமாரபாளையம்","வேங்காம்பட்டி மேட்டுத்தெரு","வேங்காம்பட்டி முதலியார் தெரு","அம்பேத்கர் நகர்","கந்தசாமி கோவில் தெரு","வீரபாண்டி ரோடு","பிள்ளையார் கோவில் முதல் கனைக்காடு","சிமென்ட் ரோடு","மாரியம்மன் கோவில் தெரு","சி.எ.காளிகவுண்டர் தெரு","அந்தனர் தெரு","வீரபாண்டி ரோடு","வெள்ளாளர் தெரு","பார்க் ரோடு","திருச்சி மெயின் ரோடு","பார்க் ரோடு","கோவிந்த செட்டி தெரு","சிமென்ட் ரோடு","போலீஸ் ஸ்டேசன் ரோடு","பிள்ளையார்கோவில் முதல் கனைக்காடு ரோடு","அஞ்சலகத் தெரு","புதுத்தெரு","பி.மேட்டூர் ரோடு","பள்ளர் தெரு","தண்ணீர் தொட்டி ரோடு","அம்மன் காலனி","செக்காரத் தெரு","நடேச கவுண்டர் தெரு","பார்க் ரோடு","திருச்சி மெயின் ரோடு","பி.மேட்டூர் ரோடு","சிவசக்தி நகர்","வெற்றி நகர்","பனங்காடு","பி.மேட்டூர் ரோடு உப்பிலியர் தெரு"];
   let panamarathu_patti = ["ஏரிரோடு","ஏரிரோடு – 2","அடிக்கரை காட்டு கொட்டாய்","அடிகரை காட்டு கொட்டாய்","பள்ளர் தெரு","அடிக்கரை காட்டு கொட்டாய்","காளியா கோயில் புதூர்","புதுவகை காட்டு கொட்டாய்","தெற்கு மெயின் ரோடு","இச்சமரபிள்ளையார் கோவில் தெரு","செட்டி தெரு","பழைய போஸ்ட் ஆபீஸ் தெரு","உப்பாண்டி தெரு","ஆண்டி தெரு","அடிகரை காட்டு கொட்டாய்","நல்லியாம்புதூர் காட்டு கொட்டாய்","நல்லியாம்புதூர் காட்டு கொட்டாய்","உப்பாண்டி தெரு","ரெட்டியார் தெரு","மேற்கு மெயின் ரோடு","நல்லியாம்புதூர் காட்டு கொட்டாய்","திருவள்ளுவர் சாலை","யாதவர் தெரு","தெலுங்கர் தெரு","அங்கண்ணன் தெரு","அங்காளம்மன் கோவில் தெரு","ஒட்டர் தெரு","திருவள்ளுவர் சாலை","சந்தை பேட்டை","சந்தைபேட்டை","கோட்டைக்காடு காட்டுகொட்டாய்","உலகரைமேடு","அடிக்கரைகாட்டு கொட்டாய்","ஆதிதிராவிடர் தெரு","களரம்பட்டி","தாசிகாடு","குறும்பர் தெரு","சந்தைபேட்டை","ஆதிதிராவிடர் தெரு","காந்தி நகர்","சத்தியநாராயணபுரம்","கோம்பைகாடு காட்டு கொட்டாய்","அருந்ததியர் தெரு","கம்மாளர் தெரு","வெள்ளாளர் தெரு","அங்கண்ணன் தெரு",];
   // ---------------------------------------------------------------
   let karumandurai= ["Kariyakoil","Koilputhur","Soolankuruchi","Karumandurai","Mannur","Kunoor"];
   let attur = ["Village 1","Village 2"]
   let PNPalayam = ["Village 1","Village 2","Village 3"]
   // -----------------------------------------------------------------
   
   function nameAchi(value){
   let selectss =  value;
   console.log(selectss)
   switch (selectss) {
   
     case "Karumandurai":
     
     // console.log("hdhkahskdhskdhkahsdk")
     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
     for (let i=0;i<karumandurai.length;i++){
         itemOptions += "<option>" + karumandurai[i] + "</option>";
         document.getElementById("oru_achi_hide").innerHTML = itemOptions;
         console.log(itemOptions)
     }
     
     break;
     case "Attur":
     
         // console.log("hdhkahskdhskdhkahsdk")
         var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
         for (let i=0;i<attur.length;i++){
             itemOptions += "<option>" + attur[i] + "</option>";
             document.getElementById("oru_achi_hide").innerHTML = itemOptions;
             console.log(itemOptions)
         }
         
         break;
         case "PNPalayam":
         
             // console.log("hdhkahskdhskdhkahsdk")
             var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
             for (let i=0;i<PNPalayam.length;i++){
                 itemOptions += "<option>" + PNPalayam[i] + "</option>";
                 document.getElementById("oru_achi_hide").innerHTML = itemOptions;
                 console.log(itemOptions)
             }
             
             break;
             case "ஆட்டையாம்பட்டி":
             
         // console.log("hdhkahskdhskdhkahsdk")
         var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
         for (let i=0;i<attiya_patti.length;i++){
             itemOptions += "<option>" + attiya_patti[i] + "</option>";
             document.getElementById("street_name").innerHTML = itemOptions;
             console.log(itemOptions)
         }
         
         break;
         case "இளம்பிள்ளை":
         var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
         for (let i=0;i<ela_pilai.length;i++){
             itemOptions += "<option>" + ela_pilai[i] + "</option>";
             document.getElementById("street_name").innerHTML = itemOptions;
         }
   
         break;
         case "மல்லூர்":
           // console.log("hdhkahskdhskdhkahsdk")
           var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
           for (let i=0;i<malur.length;i++){
               itemOptions += "<option>" + malur[i] + "</option>";
               document.getElementById("street_name").innerHTML = itemOptions;
           }
           
           break;
           case "பனைமரத்துபட்டி பேரூராட்சி":
           var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
           for (let i=0;i<panamarathu_patti.length;i++){
               itemOptions += "<option>" + panamarathu_patti[i] + "</option>";
               document.getElementById("street_name").innerHTML = itemOptions;
           }
           
           break;
           
           default:
           var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
           document.getElementById("oru_achi_hide").innerHTML = itemOptions;
           break;
       }
   }
   
   // // ====================================================================================================================================
    //  ondriyum --> street name   
    let Kariyakoil = ["Street 1","Street 2"];

    let Koilputhur =  ["Street 1","Street 2"];

    let Arikkavuntampatti = ["கெண்டியான்காடு","சிட்டனூர்","கொசவப்பட்டி","கரிசிப்பட்டி","மேல்காடு","குள்ளனம்பட்டி","ஆரிகவுண்டம்பட்டி","கரிசிப்பட்டி","பள்ளக்காடு","ஆரிக்கவுண்டம்பட்டி","தரவுக்காடு","கரிசிப்பட்டி","அழக்கப்பன்காடு","கல்லங்காடு","அய்யண்ணவளைவு","கல்லங்காடு","அய்யண்ணவளைவு தெற்கு பகுதி",];

    let Cennakiri = ["எஸ்.பாலம்","அண்ணாநகர்","கோனாய்காடு","பேரான்காடு","தாசன்காடு","பூஞ்சோலைகாடு","வேடிச்சிப்பாளையம்","கிழக்கு காடு","வெற்றிலைகாரன் காடு","பாட்டகிழவன் காடு","இருசனாம்பட்டி அருந்ததியர் தெரு","வட்டமலை காலனி","கோணைக்காடு","வட்டமலை காலனி","தியாகிகுமரன் காலனி","பட்டகாரன் காடு","அய்யர் காடு","சானார் தெரு","மூர்த்திகாடு","சோழியன் காடு","சென்னகிரி ஆதிதிராவிடர் காலனி","இருசனாம்பட்டி","பழையூர் இருசனாம்பட்டி","செட்டியார் காடு ","இறக்குடையன் காடு","தோப்புக்காரன் காடு","பழையூர் இருசனாம்பட்டி","அண்ணாகாலனி","நந்தவனகாடு","சங்கர் நகர்","சென்னகிரி","நசுவன் காடு","செம்பரையான் காடு","பெரும்பாறைகாடு","கோமாளிகாடு","காசாணிகாடு ",];

    let Ettimanikkampatti = ["செங்கோடம்பாளையம்","அருவங்காடு","தீப்பாஞ்சாங்காடு","அருவங்காடு","எட்டிமாணிக்கம்பட்டி","எட்டிமாணிக்கம்பட்டி","எட்டிமாணிக்கம்பட்டி","ஆண்டிப்பட்டி",];

    let Inam_pairoji = ["அரியானூர்","ஆர்.எஸ்.ரோடு","அய்யர் தோட்டம்","எம்.ஜீ.ஆர்.நகர்","நல்ராயன்பட்டி","நாயக்கன்வளவு","முடக்கு மாரியம்மன் கோவில்","காக்காயன் தெரு","சாமியார் வளவு","காக்காயன் தெரு","காட்டாணை தெரு","வாதரசம்பட்டி","பெத்தாய்க்காடு","காட்டுவளைவு காடு","ஆலத்திகாடு","பெருமாள் கோவில் காலனி","சேரன்குறை காலனி","வாதரசம்பட்டி","வடக்கு காடு","பைரோஜி அக்ரஹாரம்","பலகான் தெரு","புதுப்பாளையம்","பிச்சம்பாளையம் மேல்தெரு","அரசம்பாளையம் ","அடசம்பாளையம் காலனி","காமாயிவளவு","வடக்கு காடு","பிச்சம்பாளையம் கீழ் தெரு",];

    let Katattur_akraharam =["முக்கோணம்பாளையம்","நாடார் தெரு","சேர்வம்பாளையம்","இராஜாஜி பாலிடெசக்னிக் எதிரில்","முக்கோணம்பாளையம்","கடத்தூர் மேல்தெரு","கடத்தூர் கீழ்த்தெரு","இருசா கோவில் காடு","கூலிப்பட்டி","சேவிக்காடு","மேல்காட்டு வளவு","மந்திகாடு","புதுக்காடு","அம்மன் கோவில் காடு","பி கே வளவு","மோலையன் தெரு","புஞ்சைக்காடு வளவு",];

    let Kalparappatti = ["மணக்காடு","மலங்காடு","உலப்பன்குட்டை","மாட்டுகரான்முனியப்பன்கோவில்","பொந்திலியான்குட்டை","சேவாம்பாளையம்","எட்டிமரதுக்காடு","மலங்காடு","பள்ளக்காடு","மினியனூர்","சொரக்காபாளையம்","மேல்காட்டுவளவு","கீழ்காட்டு வளவு","அம்மன்கோவில் வளவு","வாத்தியார்காடு","புதுப்பாளையம் காலனி","புதுப்பாளையம்","நெட்டக்குப்பன் காடு","காரப்பின்னிவளவு","ஊத்துக்கிணத்து வளவு","சக்தி நகர்","ஜே.ஜே.நகர் (ஏரிக்கரை)","கொட்டக்கரன் காடு","ஏரிக்கரை","ஊத்துகிணத்து வளவு","முருங்கமரம் (மெயின்ரோடு)","நாடார்தெரு","வேட்டைகாரன்தெரு","பெருமாள்கோவில் தெரு","மாரியம்மன்கோவில் தெரு","நைனாகவுண்டர்வட்டம்","நாச்சியாரம்மன்கொவில் வீதி","ஆணைகவுண்டர் தெரு","எம்.ஜி.ஆர்.நகர்","4 ரோடு மாரியம்மன்கோவில் தெரு","சமாதிகாடு","புளியந்த்தோப்பு","நரிக்குட்டை","பாறைக்காடு","அண்ணாநகர்","கொம்புகாரன்காடு","சேவிக்காடு","கொம்பாடிப்பட்டி","கொம்பாடிப்பட்டி காலனி","சுகுமார் காலனி","நரிக்குட்டை காடு","அன்னமார்கோவில்",];

    let kiraipappampati= ["மேட்டுக்காடு","கோணங்காடு","மலையனூர்","குண்டுக்கல்காடு","சங்கரன் கரடு","முனியப்பன் கோவில் வட்டம்","மன்னாதன்காடு","செங்காடு","குட்டக்காடு","குட்டக்காடு காலனி","புதூர்காட்டுவளவு","குள்ளப்பச்சூர்","பள்ளக்காடு","புதூர் மேற்கு","புதூர்","பெருமாள் கோவில் கரடு ","காட்டூர்","காட்டூர்","கீரைப்பாப்பம்பட்டி மேற்கு","கட்டேரியம்மன் கோவில் வீதி","வாழக்குட்டை","மொட்டையன் தெரு","கீரைப்பாப்பம்பாடி குட்டி கரடு","மேட்டுக்காடு","ஓலைப்பட்டி","அம்மன் கோவில் தெரு","காட்டூர் வளவு","ஓலைப்பட்டி காட்டூர் வளவு","சின்னதொட்டிபட்டி காலனி","மூலக்காட்டான் தோப்பு","ஓலைப்பட்டி","சேவங்கரடு","எம்.ஜி.ஆர்.நகர்","சின்னதொட்டிபட்டி காலனி","நாடார் தெரு (அழகுசமுத்திரம் எரி)","சுப்ரமணிய நகர்","நீர்பிடிப்பு பகுதி","வயக்காடு","கட்டியாங்காடு","ஓலைப்பட்டி காட்டூர் வளவு கலர் பகுதி","ஏரிக்காடு","கீரைப்பாப்பம்பாடி வடக்கு மற்றும் தெற்கு பகுதி",];

    let Maramankalattuppatti  = ["ஊமாரிக்காடு","வேங்கான்காடு","சாமியார் காடு","சின்னபூசாலியூர்","எஸ்.வி.பட்டேல் நகர்","சின்னப்பா நகர்","கீதா நகர்","கீதா நகர் அனெக்ஸ்","பெரியபூசாலியூர்","நாடார் தெரு","அஜய் கார்டன்","காட்டுக்கொட்டாய்","சொர்ணா கார்டன்","செல்லப்பா நகர் ","நாடார் தெரு","சின்னபூசாலியூர் நடுநிலைப்பள்ளி எதிரில்","மாரமங்கலத்துப்பட்டி","பட்டேல் நகர்","சக்தி நகர்","சக்தி நகர்","எஸ்.கே.நகர்","சின்னபாட்டன்காடு","மாருதி நகர்","முல்லை நகர்","மொட்டையன் தெரு","கங்கை நகர்","பூங்கா நகர்","முருகன் நகர்","கோபால்லைன்","செட்டியார்லைன்","பஞ்சமி காட்டுவளவு","காமராஜர் நகர்","மாரிமுத்தான்காட்டுவளவு","மூங்கில்குத்து","காளியம்மன் கோவில் தெரு","பழையகாவல் நிலையம் எதிரில்","மொண்டிபழனி வீதி","பழைய பிள்ளையார் கோவில் தெரு","எம்.ஜி.ஆர்.நகர்","புதுமாரியம்மன்கோவில்தெரு","பஞ்சமிகாடு","புதுமாரியம்மன்கோவில் 1 & 2","காளியம்மன் கோவில் தெரு","காவல் நிலையம்எதிரில்","மூங்கில்குத்து தெரு","மோகன் நகர் டவுன்சிப்","கலைகார்டன்ஸ்","லட்சுமி நகர்","ராசி நகர்","என்.பி.எஸ் நகர்","சுப்பிரமணி நகர்","மாரமங்கலத்துப்பட்டி","பாரதி நகர் ","அம்பேத்கர் நகர் ","மோகன் நகர் எதிரில்","குறிச்சி நகர்","கெச்.எம்.டி.ஐ","சாலையோரகுடியிருப்பு","ரிலையன்ஸ் வீதி","இந்திரா நகர்","குறிஞ்சி நகர்","இந்திரா நகர் 2 – வது வீதி","இந்திரா நகர் 3 – வது வீதி","வி.ஐ.பி.நகர்","கே.கே.நகர்","கணபதி நகர்","திருமால் நகர்","கணபதி நகர்","ஓம்சக்தி நகர்","கரட்டூர் கந்தசாமிபாளையம்","பொன் நகர்","சாமுண்டி நகர்","கே.ஆர்.என்.நகர்","இடும்பன்காடு","மோகன் நகர் டவுன்சிப்","மோகன் நகர் டவுன்சிப்",];

    let Marulaiyampalaiyam = ["முயல்காடு வட்டம்","மயில் காடு வட்டம்","திருசெங்கோடு மெயின் ரோடு தென்மேற்கு பகுதி","மண்கரடு","திருசெங்கோடு வடமேற்கு ரோடு ","திருசெங்கோடு வடகிழக்கு ரோடு","முனியப்பன்கொவில் வீதி ","மேல் தெரு","முத்துக்குமரன் கோவில் பின்புறம்","முனியப்பன் கோவில் முன் பகுதி கிழக்கு","தேங்காய்காரன் காடு","முத்துக்குமரன் கோவில் முன் பகுதி ஊ.ஒ.துவக்கப்பள்ளிதெரு 1 & 2","திருசெங்கோடு சாலை கிழக்கு தெரு","மாரியம்மன் கோவில் வடக்கு தெரு","மாரியம்மன் கோவில் பின்புறம்(மேற்கு தெரு)","தென்கிழக்கு திருசெங்கோடு ரோடு ","ராஜ வீதி","துவக்கப்பள்ளி வீதி 3","தோட்டக்காரன் ரோடு","தண்டவளன்காடு","தடிக்காரன் காடு",];

    let Mututurai = ["நல்லாம்பட்டி","பூமாண்டாம்பட்டி","நல்லாம்பட்டி","புதுரோடு","நல்லாம்பட்டி","நாயக்கன்பட்டி","நாயக்கன்பட்டி","நாயக்கன்பட்டிகாட்டுவளவு",];

    let Murunkappatti = ["சித்ரனூர்","பெத்தாம்பட்டி","நல்லகவுண்டனூர்","நாதன்காடு","பெத்தாம்பட்டி","முருங்கம்பட்டி","முருங்கம்பட்டி ஆதிதிராவிடர் காலனி","பெத்தாம்பட்டி","முருங்கம்பட்டி","பூம்பட்டியானூர்","மாந்தோப்பு","மோட்டூர்","காரந்தோப்பூர்","மாந்தோப்பு","லகுவம்பட்டி","முருங்கம்பட்டி மேல்காடு","லகுவம்பட்டி","பெத்தாம்பட்டி மேல்காடு","பெத்தாம்பட்டி ","பெத்தாம்பட்டி மேல்காடு",];

    let Es_Papparappatti = ["என்.எஸ்.கே.தெரு","அண்ணா நகர்","அருள்மணி தெரு","ராஜவீதி","தியாகி குமரன் தெரு","செங்குட்டுவன் தெரு","காந்தியார் தெரு – 1","காந்தியார் தெரு – 2","காந்தியார் தெரு – 3","பாரதியார் தெரு – 1","என்.எஸ்.கே.தெரு","சின்னுசாமி தெரு – 1","வா.ஊ.சி.தெரு","சின்னசாமி தெரு – 2","சின்னுசாமி தெரு – 1","எம்.ஜி.ஆர்.நகர்","சின்னசாமி தெரு – 2","காந்தி நகர்","ஏரிக்காடு","தியாகிகுமரன் தெரு","புகழேந்தியார் தெரு","கரிகாலன் தெரு","ராஜ வீதி","ராஜ வீதி","புகழேந்தியார் தெரு","வள்ளுவர் தெரு","பரஞ்சோதியார் தெரு","காமராஜர் தெரு","ராசிபுரம் மெயின் ரோடு","ஆப்ரகாம்லிங்கன் தெரு","சாக்ரடீஸ் நகர்","ஊர்கவுண்டர் காடு","கோணங்காடு","எம்.ஜி.ஆர்.நகர்","கூத்தங்காடு","மேட்டுக்காடு","ஊஞ்சக்காடு","விஸ்வநாதன் நகர்","பொன்னாங்காடு","கம்புகுத்திகாடு","கோணங்காடு","போயர் தெரு","முத்தனம்பாளையம்","முத்தனம்பாளையம் காலனி","சித்தேரிக்காடு","முனியப்பன் கோவில் காடு","மெத்தைகொட்டய்காடு","வெள்ளையகவுண்டனூர்","கொடியன்காடு","கடுவுக்காரன் காடு","ராசிபுரம் மெயின் ரோடு",];

    let Periya_cirakapaṭi = ["சடையாண்டிஊற்று","அம்மன் நகர்","மிளகாய்காரன்தெரு","நாடார் தெரு","கச்சிவலியான்காடு","பண்டதகாரன் காடு","சாவடியான் காடு ","வட்டக்கல்","தொப்பாளன்வளவு","பாரைக்கொட்டாய்","பொதியன்தெரு","மாமரதுக்காடு","நாவப்பாளையம்","பண்டதகாரன்","பெரியசீரகாபாடி காலனி","நாடார் தெரு","செம்மொழி நகர் ","பெரிய சீரகாபாடி","காமராஜ் நகர் மற்றும் சுகுமார் காலனி","ஏரிக்கடை","பண்டாரன்காடு","அம்மன்கோவில் காடு","புதுரான்வளவு","சங்ககிரி மெயின் ரோடு","அண்ணாநகர் ","மாக்கலூர்","சின்னசீரகாபாடி சந்தைபேட்டை கிழக்கு","சின்னசீரகாபாடி கீழ்தெரு","சொரக்கப்பாளையம்","சின்னசீரகாபாடி தேர்மைதானம் ","சின்னசீரகாபாடி பெரியமாரியம்மன் கோவில் வீதி","தேர்மைதானம்","சந்தைபேட்டை மேற்கு","ஏரிக்காடு","சமத்துவபுரம்","பிள்ளையார்கோவில்வீதி","சின்னசீரகாபாடி மேல்தெரு","சின்னசீரகாபாடி கணபதி நகர்","சின்னசீரகாபாடிகாமராஜர் காலனி","சின்னசீரகாபாடிகஸ்தூரிபாய் நகர்","அருந்ததியர் தெரு",];

    let Perumakavuntampatti = ["காக்காபாளையம் மெயின் ரோடு","முனிசிப் தெரு","சபாபதி செட்டியார் காலனி","பாறைக்காடு முதல் தெரு","பாறைக்காடு 2வது தெரு","எல்.கே.பிள்ளார் தெரு","மெயின் ரோடு","தப்பக்குட்டைபிரிவு","காக்காபாளையம் மெயின் ரோடு","கரடிகுண்டு தெரு","62 மெயின் ரோடு ","காளியம்மாள் கோவில் தெரு","வீரபத்திரன் கோவில்தெரு","அண்ணாமலைமுதலியார் தெரு","அம்மன் கோவில் காடு","அண்ணா நகர் ","பெருமாள் கோவில் ரோடு","ஏரிக்கரை","ஒ.எச்.டி. தெரு","பஜனை கோவில் தெரு","கசாப் தெரு","தெற்கு வளவு","ஆசாரிபட்டறை தெரு","பிள்ளையார் கோவில் தெரு","வி.பி.எஸ்.காலனி","மூலக்கரை","எம்.ஜி.ஆர்.நகர்","நாடார் தெரு","ஆசாரிபட்டறை தெரு","மெயின் ரோடு","அரசு ஆண்கள் மேல்நிலைப்பள்ளி எதிர் தெரு","அருந்ததியர் தெரு","துண்டுக்காடு","காக்காப்பாளையம் மெயின் ரோடு(கே.எம்.காலனி)","காக்காப்பாளையம் மெயின்ரோடு","போயர் தெரு","முத்துக்கவுண்டர் தெரு","அம்பேத்கர் நகர்","லட்சுமி நகர்","வீரபத்திரன் கோவில் தெரு","சதாசிவம் காலனி","பெருமாள்கோவில் ரோடு","முருகேஷ் கவுண்டர் காலனி","பெருமாள்கோவில் நகர்","அசோக் நகர்","காமதேனு நகர்","சஞ்சீவி நகர்","ரெட்டிபட்டி-ராமாபுரம் மெயின் ரோடு ","ராமாபுரம்","ராமாபுரம் காட்டுவளவு","மண்கரடு புதுகாலனி","கொத்துக்காரன்காடு","மண்கரடு பழைய காலனி","கருநெல்லிக்காடு","சின்னமணிக்காடு","ரெட்டிப்பட்டி","பள்ளக்காடு","செம்பாயிவளவு","சாய் நகர்",];

    let Perumampatti = ["புதுரோடு பஸ் ஸ்டாப்","தும்பாதூளிப்பட்டி காலனி","காந்தி நகர்","நாடார் தெரு","சத்யா நகர்","தும்பாதூளிப்பட்டி","பூசநாயக்கனூர்","பால்காரர் வட்டம்","தும்பாதூளிப்பட்டி காந்தி நகர் ","வலியன்காடு","ஓம்காளியம்மன் வட்டம்","பூசநாயக்கனூர்","பூசநாயக்கனூர் காலனி","மேல்காடு","கிள்ளன்வட்டம்","கோவில்காடு","மேல்காடு","பால்காரர் வட்டம் ","அண்ணாமலை வட்டம்","காந்திநகர்","பெருமாம்பட்டி","தும்பாதூளிப்பட்டி","பெருமாம்பட்டி","ஏரிக்காடு","ஏரிக்காடு காலனி","பெருமாம்பட்டி காலனி","புதுகுட்டை","மூக்கரையன் தெரு","நந்தக்காடு","உடையான்காடு","ஊத்து ஓடைகாடு","ஏரிக்காடு","பாறைக்காடு","பண்டதக்காரர் வட்டம்","மூக்கரையன் தெரு","இருளன் வட்டம்","தாசன் வட்டம்","சந்தைக்கரடு","கொத்தனூர்","கொத்தனூர் காலனி","வயக்காடு","கோன்றிக்காடு","சின்னயூர்கொத்தன்னோர்","சந்தைக்கரடு","கனவாய்காடு","பூசாரி வட்டம்","உடையார் வட்டம்","பனங்காடு","சின்னகஞ்சமலை அடிவாரம்","கனவாய்காடு","ஊத்து ஓடை காடு","சக்திகோவில் வட்டம்",];

    let Pulavari_akraharam= ["ஆத்துக்காடு","ஊரடி முனியப்பன் கோவில்","செங்கல் சூளை காடு","அம்மன் கோவில் காடு","தண்ணீர்கிணத்து காடு","பிள்ளையார் கோவில் வட்டம்","பெருமாள் கோவில் தெரு","பூலாவரி கீழ் தெரு","பலகான் தெரு","பூலாவரி","ஏரிக்காடு","வயக்காடு","அருந்ததியர் காலனி","டிரான்ஸ்பார்ம்","சின்னத்தோட்டம்","மொரம்புக்காடு","பெரியகுட்டை","காளிக்காடு","தொண்டுபுட்டிக்காடு","ஆத்துக்காடு","ஆத்துக்காடு முனியப்பன் கோவில்","நரியாண்டிக்காடு","சித்தனேரி","கொடம்புக்காடு","சித்தனேரி கரட்டுப்பகுதி","புஞ்சைகாடு நடுவட்டம்","புஞ்சைகாடு கீழ்வட்டம்","புஞ்சைகாடு மூலக்கடை","புஞ்சைகாடு மேல்வட்டம்","புஞ்சைகாடு நாயக்கர் வட்டம்","புஞ்சைகாடு கீழ்வட்டம்","புஞ்சைகாடு நடுவட்டம்",];

    let Puttur_akraharam = ["காந்தி நகர்","எம்.ஜி.ஆர்.நகர்","இச்சிமரத்துக்காடு","இச்சிமரத்துக்காடு","செட்டிக்காடு","ஏரிக்காடு","வடக்குத்தெரு","வடக்குத்தெரு","பெருமாள் கோவில் தெரு","காளியம்மன் குட்டை காடு","கருத்தான்காடு ","வட்டக்காடு","இருசா கோவில் காடு","பலகான் தெரு","சக்திகோவில்","சீவக்காய்மரத்துக்காடு","சந்தனக்காரன் காடு","மலங்காடு","பிள்ளையார் கோவில் வட்டம்","கொளுக்கட்டை தெரு","பெருமாள் கோவில் தெரு ","தெற்குத்தெரு","வானக்காரன்காடு","சின்னபுத்தூர்","ஏரிவயக்காடு","நத்தக்காடு","கொளுக்கட்டை தெரு","பெரியார் நகர்","அருந்ததியர் தெரு","ஐந்துமுனியப்பன் கோவில்","கொளுக்கட்டை தெரு","சந்தனக்காரன் காடு","அண்ணா நகர்","சின்னபுத்தூர்","நடுப்புத்தூர்","சின்னபுத்தூர்","முனியப்பன் கோவில் காடு","காளியம்மன்கோவில் வீதி",];

    let Irajapalaiyam= ["இராஜாபாளையம் ஏடி காலனி","புடவைக்காரன் காலனி","பனங்காடு","ஆர்.பெத்தாம்பட்டி","சேலம் மெயின் ரோடு","சோளக்காட்டார் காடு","ஆர்.பெத்தாம்பட்டி கலர் காடு","ஆர்.பெத்தாம்பட்டி பெருமாள் கோவில் காடு","ஆர்.பெத்தாம்பட்டி கருவாட்டு பாறை","சேலம் மெயின் ரோடு ","கீழ்தெரு","கரிக்கட்டாம்பளையம்","சோலைக்கவுண்டர் காடு ","சின்ன ஆண்டிப்பட்டி பள்ளக்காடு","புதுஇராஜாபாளையம்","இராஜாபாளையம் கவுண்டர் தெரு","சின்ன ஆண்டிபட்டி காட்டுவளவு","நைனாம்பட்டி சேலம் மெயின் ரோடு","முனியப்பன் கோவில் தெரு","கொடுமைக்காரன் காடு","மல்லேஸ்வரன் கோவில் காடு","தர்மகாரர் காடு","நைனாம்பட்டி சேலம் மெயின் ரோடு","முனியப்பன் கோவில் வீதி","மாரியம்மன் கோவில் வீதி","பாறைகாடு","அசலியான்கவுண்டர்காடு","பாப்புக்காடு","பாறைக்கொட்டாய்","நைனாம்பட்டி சேலம் மெயின் ரோடு","லட்சுமனகவுண்டர் காடு","பிள்ளையார் கோவில் தெரு","மாரியம்மன் கோவில் தேரு ","காந்தி நகர்","இராஜீவ் காந்திநகர்","சேலம் மெயின் ரோடு","அரிமா நகர்","இராஜாஜீ நகர்",];

    let Rakkippatti= ["செங்கோடம்பாளையம்","சேர்வாம்பாளையம்","கொன்னாங்குட்டை வளவு","கரட்டுக்காடு","பாங்கிணத்துகாடு","செங்கோடம்பாளையம்","ஆர்.புதுப்பாளையம்","ராக்கிப்பட்டி","ஆதிதிராவிடர் காலனி","ஆயிபாளையம்","ராக்கிப்பட்டி அருந்ததியர் தெரு","ராக்கிப்பட்டிa","அருந்ததியர் தெரு","தோட்டக்காடு","ஆதிதிராவிடர் தெரு","ராக்கிப்பட்டி",];

    let Cenaippalaiyam = ["தாசன் காடு","நாடார் தெரு","மேல் அய்யம்பாளையம்","மேல் அய்யம்பாளையம்","கீழ் அய்யம்பாளையம்","சேர்வாம்பாளையம்","பாறைகாடு","பலாகன் காலனி","பாறைகாடு","சேனைப்பாளையம்","சுந்தர் பெருமாள் கோவில் தெரு","மாரியம்மன் கோவில் தெரு","பாட்டப்பன் கோவில் தெரு",];

    let Uttamacolapuram = ["சின்னதுபூசாரிக்காடு","மலங்காடு","நாயக்கர் வட்டம் ","சேனைக்காடு","ராஜ வீதி","கணக்குபிள்ளைக்காடு","மாரியம்மன் கோவில் தெரு","பிள்ளையார் கோவில் தெரு","ஆதி திராவிடர் தெரு","கணக்குப்பிள்ளைக்காடு","ஆணைகவுண்டன் தெரு","சூளைமேடு","மேல்காட்டான் தெரு","சேனைக்காடு","கள்ளங்காடு","காட்டூர்","வேலங்காடு","மாரியம்மன் கோவில் தெரு","வேட்டுவன்குட்டைக்காடு","பூசாரிக்காடு","அம்மையப்பா நகர்","அரியாம்பாளையம்","பாறைக்காடு","நடு தெரு","மாரியம்மன் கோவில் தெரு","பொரப்பன்காடு","விளாமரத்துக்காடு","பழனிகவுண்டர்காடு","ஜோசியர் வட்டம்","வேட்டுவன்குட்டைக்காடு","அரியாம்பாளையம்","தாசன்காடு","ஆணைகவுண்டன் தெரு","சூளைமேடு காலனி (அரிசனகாலனி)","சூளைமேடு","ஸ்ரீதரன்காடு","சூளைமேடு","ஊர்மூப்பன்காடு","எம்.ஜி.ஆர்.நகர்","பிள்ளுக்கடை தெரு","அட்டவணை பூலாவரி","எட்டிமரத்துக்காடு","கீழக்காடு",];

    let Virapanti = ["பூஞ்செடி காடு","மதுராயன் காடு","துளுக்கன் காடு","உப்புக்குட்டை காடு","பச்சபாளிகாடு","புதுபட்டி மாரியம்மன் கோவில்","சங்கரன்காடு","புதுபட்டி மாரியம்மன் கோவில்","காவடி காடு","வெள்ளக்காடு","கோத்துப்பள்ளி காடு","கவுத்துக்காரன் காடு","அக்ரஹாரம்","குழும்புக்காடு","மஞ்சள்துறை காடு","நத்தக்காடு","பேக்காடு","சேவிக்காடு","செக்போஸ்ட்","கார்த்திக் நகர்","வீரபாண்டி காலனி","டிப்போ நகர்","இந்திரா நகர்","காமராஜர் நகர்","தோப்பு காடு","அரியானூர்","வீரபாண்டி காலனி","வீரபாண்டி காலனி","காசியன் காடு","குட்டக்காடு","ராஜவீதி","மேட்டுதெரு","காசியன் காடு","கீழ் தெரு","இராஜவீதி",];

    let Vempatitalam = ["பழைய தெரு","புது தெரு","சவுண்டம்மன் கோவில் தெரு","மெயின் ரோடு","பெருமாள் கோவில் தெரு","மாரியம்மன் கோவில் வீதி","வயக்காடு","ஏரிக்கரை","மெயின்ரோடு","போஸ்ட்ஆபீஸ் மெயின்ரோடு","டி.என்.எஸ்.தெரு","பண்டாரி பஜனை கோவில்","அரசுமருத்துவமணை","அண்ணா தெரு","மெயின்ரோடு","பி.எஸ்.எஸ்..ஆர்.காம்பவுண்ட்","பஞ்சாயத்து ஆபிஸ் பின்புறம்","அண்ணா தெரு","பிள்ளையார்கோவில் தெரு","லைன் வீதி","செல்வவிநாயகர்கோவில் தெரு","மெயின் ரோடு","செட்டியார்காலனி","புதுச்சேரி","பெருமாள் கோவில் தெரு","வீரபாண்டியார் நகர்","ஆர்.வி.காம்பவுண்ட்","பெருமாள் கோவில் தெரு","இந்திரா நகர்","தாயம்மாள் வீதி","செட்டியார் காலனி","எஸ்.வி.எஸ்.தெரு","திருவளிப்பட்டி துவக்கப்பள்ளி மேற்கு","திருவளிப்பட்டி பெருமாள் கோவில் தெரு","போயர்தெரு","ஊராட்சி ஒன்றிய துவக்கப்பள்ளி (மேற்கு)","செல்லியம்பாளையம்","மதுரைவீரன் கோவில் தெரு","பலகான் தெரு","மெயின் ரோடு","செல்லியம்பாளையம் கிராமம்","திருவளிப்பட்டி","சந்தைப்பேட்டை","காட்டுக்கொட்டாய்","ஊராட்சி ஒன்றிய துவக்கப்பள்ளி","மேற்கு","தெற்குபகுதி",];

    function thairu(value){
        let select = value;
        switch (select) {
            case "Kariyakoil":
                var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                for (let i=0;i<Kariyakoil.length;i++){
                    itemOptions += "<option>" + Kariyakoil[i] + "</option>";
                    document.getElementById("street_name").innerHTML = itemOptions;
                    console.log(itemOptions)
                }
                break;

            case "Koilputhur":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Koilputhur.length;i++){
                        itemOptions += "<option>" + Koilputhur[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
            
            case "ஆரிக்கவுண்டன்பட்டி":    
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Arikkavuntampatti.length;i++){
                        itemOptions += "<option>" + Arikkavuntampatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
            
            case "சென்னகிரி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Cennakiri.length;i++){
                        itemOptions += "<option>" + Cennakiri[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
            
            case "எட்டிமாணிக்கம்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Ettimanikkampatti.length;i++){
                        itemOptions += "<option>" + Ettimanikkampatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;            
            
                case "இனாம் பைரோஜி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Inam_pairoji.length;i++){
                        itemOptions += "<option>" + Inam_pairoji[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
  

                case "கடத்தூர் அக்ரஹாரம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Katattur_akraharam.length;i++){
                        itemOptions += "<option>" + Katattur_akraharam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "கல்பாரப்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Kalparappatti.length;i++){
                        itemOptions += "<option>" + Kalparappatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
                case "கீரைபாப்பம்பாடி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<kiraipappampati.length;i++){
                        itemOptions += "<option>" + kiraipappampati[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
                case "மாரமங்கலத்துப்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Maramankalattuppatti.length;i++){
                        itemOptions += "<option>" + Maramankalattuppatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
                case "மருளையம்பாளையம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Marulaiyampalaiyam.length;i++){
                        itemOptions += "<option>" + Marulaiyampalaiyam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break;
                case "மூடுதுறை":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Mututurai.length;i++){
                        itemOptions += "<option>" + Mututurai[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "முருங்கப்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Murunkappatti.length;i++){
                        itemOptions += "<option>" + Murunkappatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "எஸ். பாப்பாரப்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Es_Papparappatti.length;i++){
                        itemOptions += "<option>" + Es_Papparappatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "பெரிய சீரகாபாடி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Periya_cirakapaṭi.length;i++){
                        itemOptions += "<option>" + Periya_cirakapaṭi[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "பெருமாகவுண்டம்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Perumakavuntampatti.length;i++){
                        itemOptions += "<option>" + Perumakavuntampatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "பெருமாம்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Perumampatti.length;i++){
                        itemOptions += "<option>" + Perumampatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "பூலாவரி அக்ரஹாரம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Puttur_akraharam.length;i++){
                        itemOptions += "<option>" + Puttur_akraharam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "புத்தூர் அக்ரஹாரம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Puttur_akraharam.length;i++){
                        itemOptions += "<option>" + Puttur_akraharam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "இராஜாபாளையம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Irajapalaiyam.length;i++){
                        itemOptions += "<option>" + Irajapalaiyam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "ராக்கிப்பட்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Rakkippatti.length;i++){
                        itemOptions += "<option>" + Rakkippatti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "சேனைப்பாளையம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Cenaippalaiyam.length;i++){
                        itemOptions += "<option>" + Cenaippalaiyam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "உத்தமசோழபுரம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Uttamacolapuram.length;i++){
                        itemOptions += "<option>" + Uttamacolapuram[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "வீரபாண்டி":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Virapanti.length;i++){
                        itemOptions += "<option>" + Virapanti[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                case "வேம்படிதாளம்":
                    var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                    for (let i=0;i<Vempatitalam.length;i++){
                        itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                        document.getElementById("street_name").innerHTML = itemOptions;
                        console.log(itemOptions)
                    }
                break; 
                   
                // //                            panamarathupatti         all                 not working 
                // case "அமாணி கொண்டலாம்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "அம்மாபாளையம்":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "தாசநாயக்கன்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "ஏர்வாடி வாணியம்பாடி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "கெஜ்ஜல்நாயக்கன்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "கம்மாளப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "குரால்நத்தம்":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "மூக்குத்திப்பாளையம்":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "நாழிக்கல்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "நெய்க்காரப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "நிலவாரப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "பள்ளித்தெருப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "பாரப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "பெரமனூர்":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "சந்தியூர் ஆட்டையாம்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "சந்தியூர்":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "தம்மநாயக்கன்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "திப்பம்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "தும்பல்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                // case "வாழக்குட்டப்பட்டி":
                //     var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
                //     for (let i=0;i<Vempatitalam.length;i++){
                //         itemOptions += "<option>" + Vempatitalam[i] + "</option>";
                //         document.getElementById("street_name").innerHTML = itemOptions;
                //         console.log(itemOptions)
                //     }
                // break;
                

                //                            salem ondriyum           all                 not working 
            default:
                break;
        }
    }


   
   // ==================================================================================================================
 
   let ration = ["புதிய மின்னணு குடும்ப அட்டை விண்ணப்ப", "நகல் மின்னணு குடும்ப அட்டை விண்ணப்ப", "குடும்ப அட்டையில் குடும்ப தலைவர் மாற்றம்", "குடும்ப‌ உறுப்பினர் சேர்க்கை", "குடும்ப உறுப்பினர் நீக்கம்", "குடும்ப அட்டை முகவரி மாற்றம்", "குடும்ப அட்டையில் கைபேசி எண் இணைக்க"];
   let aadhar = ["ஆதார் முகவரி மாற்றம்", "ஆதார் பெயர் மாற்றம்", "ஆதார் அகவை நாள் மாற்றம்", "ஆதார் முகவரி (ம) பெயர் மாற்றம்", "ஆதார் அகவை நாள், (ம) முகவரி மாற்றம்பம்", "ஆதார் அகவை நாள், (ம) பெயர், மாற்றம்", "ஆதார் அகவை நாள், பெயர், (ம) முகவரி மாற்றம்", "ஆதார் பாலினம் மாற்றம்"];
   let pan =  ["புதிய பான் அட்டை விண்ணப்பம்", "பான் எண்ணை ஆதாரில் இணைத்தால்", "நகல் பான் அட்டை", "பான் அட்டையில் அகவை நாள் மாற்றம்", "பான் அட்டையில் பெயர் மாற்றம்", "பான் அட்டையில் புகைப்படம் மாற்றம்", "பான் அட்டையில் கையெழுத்து புதுபித்தல்", "பான் அட்டையில் சிறியவரிலிருந்து பெரியவர்"];
   let nalavariyum = ["நலவாரியம் புதுப்பித்தல்", "நலவாரியம் விண்ணப்பித்தால்"];
   let voter_id = ["புதிய வாக்காளர் அட்டை விண்ணப்பம் புதுப்பித்தல்", "வாக்காளர் அட்டையில் முகவரி மாற்றம்", "நகல் வாக்காளர் அட்டை விண்ணப்பம்", "வாக்காளர் அட்டையில் பெயர் மாற்றம்", "வாக்காளர் அட்டையில் அகவை நாள் மாற்றம்", "வாக்காளர் அட்டையில் புகைப்படம் மாற்றம்", "வாக்காளர் அட்டையில் உறவு முறை பெயர் மாற்றம்", "வாக்காளர் அட்டையில் தொகுதி மாற்றம்"];
   function workTitle2(value){
   let selectss =  value;
   switch (selectss) {
       
       case "ஆதார்":
       
     
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<aadhar.length;i++){
           itemOptions += "<option>" + aadhar[i] + "</option>";
           console.log("2")
           document.getElementById("work2").innerHTML = itemOptions;
           console.log("1")
           console.log(itemOptions)
       }
       break;
       case "குடும்ப அட்டை":
       
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<ration.length;i++){
           itemOptions += "<option>" + ration[i] + "</option>";
           document.getElementById("work2").innerHTML = itemOptions;
           console.log(itemOptions)
       }
       break;
       case "பான்":
      
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<pan.length;i++){
           itemOptions += "<option>" + pan[i] + "</option>";
           document.getElementById("work2").innerHTML = itemOptions;
           console.log(itemOptions)
       }
       break;
       case "நலவாரியம்":
      
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<nalavariyum.length;i++){
           itemOptions += "<option>" + nalavariyum[i] + "</option>";
           document.getElementById("work2").innerHTML = itemOptions;
           console.log(itemOptions)
       }
       break;
       case "வாக்காளர் அட்டை":
       
       var itemOptions = "<option value='none' selected disabled hidden>Select an Option </option>";
       for (let i=0;i<voter_id.length;i++){
           itemOptions += "<option>" + voter_id[i] + "</option>";
           document.getElementById("work2").innerHTML = itemOptions;
           console.log(itemOptions)
       }
       break;
    //     case "இதர":
    //         $("#workCover").hide();
    //         $("#ithura").show()
            
            
    //    break;

       default:
       
       break;
   }
   }